---
kind: property
id: P:Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.CreatingCloudSharedLocal
source: html/34a1b78a-db34-0c9e-1444-9bb306ce5625.htm
---
# Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.CreatingCloudSharedLocal Property

Indicates if it is creating cloud shared local model.

## Syntax (C#)
```csharp
public bool CreatingCloudSharedLocal { get; }
```